AuthConfiguration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействительный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

AuthConfiguration/src/CommonForms/ФормаАвторизации/Module.bsl
#Область ОписаниеПеременных
&НаКлиенте
Перем АвторизацияУспешна;
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	WSHShell = Новый COMОбъект("WScript.Shell");
	WSHShell.SendKeys("% ");
	WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");
	
	АвторизацияУспешна = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если АвторизацияУспешна = Ложь Тогда
		ЗавершитьРаботуСистемы();
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Вход(Команда)
	ОбработкаВхода();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПароль(Команда)
	Если Элементы.Пароль.РежимПароля = Истина Тогда
		Элементы.Пароль.РежимПароля = Ложь;
		Элементы.ПоказатьСкрытьПароль.Картинка = БиблиотекаКартинок.СкрытьПароль;
	Иначе
		Элементы.Пароль.РежимПароля = Истина;
		Элементы.ПоказатьСкрытьПароль.Картинка = БиблиотекаКартинок.ПоказатьПароль;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбработкаВхода()
	Если Не ЗначениеЗаполнено(Логин) или Не ЗначениеЗаполнено(Пароль) Тогда
		ОбработкаОшибки("Введите данные");
	Иначе
		ТекущийПользователь = НайтиТекущегоПользователя(Логин);
		Если ТекущийПользователь = Неопределено Тогда
			ОбработкаОшибки("Такого пользователя не существует");
		Иначе
			Если Пароль = ТекущийПользователь.Пароль Тогда
				АвторизацияУспешна = Истина;
				Закрыть();
			Иначе
				ОбработкаОшибки("Пароль неверный");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиТекущегоПользователя(Параметры)
	ТекущийПользователь = Справочники.Пользователи.ПоискТекущегоПользователя(Логин);
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Возврат ТекущийПользователь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаОшибки(Ошибка)
	Элементы.ОшибкаДекор.Заголовок = Ошибка;
КонецПроцедуры
#КонецОбласти
